In [1]:
import pandas as pd
import numpy as np

In [3]:
f1 = pd.read_csv('data/file1.csv')
f2 = pd.read_csv('data/file3.csv')

In [4]:
f1.head()

   salary   useramount  percentage
0    234.0          45            6
1     45.0          56          100
2      3.4         345           34

In [10]:
f2=f2.drop('f.1',axis=1)

In [13]:
f2.columns = f1.columns
f2.head()

   salary   useramount  percentage
0       34         778           23
1       45          34           45
2       56          45          100

In [16]:
f1.compare(f2,keep_shape=True)

  salary        useramount       percentage
     self other       self other        self other
0   234.0  34.0         45   778           6    23
1     NaN   NaN         56    34         100    45
2     3.4  56.0        345    45          34   100